htmx-common-lisp.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-01-10 Wed 02:52 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>HTMX in common lisp.</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="tufte.css" type="text/css" />
<meta name="author" content="Wade Mealing" />
<meta name="description" content="REPLACE />
<meta name="theme-color" content="#fffff8"/>
<meta name="description" content="HTMX in common lisp" />
<meta http-equiv="Content-Security-Policy"  content="default-src 'self' 'unsafe-inline'; img-src https://*; child-src 'none';" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">HTMX in common lisp.</h1>
<p>
Out of respect, I cut this to its bone, exposing only what you may find useful.
</p>

<p>
I want to write online and cross platform apps.  Most of what i need is probably
suitable to be a web page and text. My needs are not graphics or webGL.  While researching my options I came across <a href="http://htmx.org">HTMX</a> which included
a haiku that spoke to me on a deeper level.
</p>

<p class="verse">
haiku<br />
&#xa0;javascript fatigue:<br />
&#xa0;longing for a hypertext<br />
&#xa0;already in hand<br />
</p>

<p>
I don't want to write javascript, I won't.
</p>

<p>
HTMX says that any language can be used.  I choose common-lisp as my backend language as it strikes the perfect balance between usability and the <a href="https://en.wikipedia.org/wiki/Lindy_effect">Lindy Effect.</a>  There
is almost no software-churn in the backend. The toolchain runs reliably and quickly and works across multiple platforms.
</p>

<p>
People talk about the downside is that Lisp ends up cursing its team as there is too much flexability in its syntax and
that no two programmers will agree on anything.  This is a non issue as I've also never had a patch sent to code I have created
so it will be functionally no different.
</p>

<p>
My stack I dub the "CHOW", Common Lisp, Htmx on Whatever.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Language</td>
<td class="org-left">Common lisp</td>
</tr>

<tr>
<td class="org-left">JS Library</td>
<td class="org-left">HTMX</td>
</tr>

<tr>
<td class="org-left">DB</td>
<td class="org-left">Sqlite</td>
</tr>
</tbody>
</table>


<p>
If i need to grow up from Sqlite, i can likely just use postgresql, but I'm not at the point where that matters.  Keep
my data simple and cached, dont rely on shitty complexities and we should be okay.
</p>

<p>
I <a href="https://github.com/wmealing/learn-htmx">worked on translating</a>  the example  "contacts.app" from the HTMX site to common-lisp. It is still being
developed and I will use it as a testing ground to see how I can improve my workflow.
</p>

<p>
I haven't demonstrated a single line of HTMX in this post to ensure that my reasons for doing this is clear.  I will
make posts on this topic in the future.
</p>

<p>
I still have many questions on how to ensure that web apps I write work predictably, reliably and portably.
</p>



<div id="outline-container-org769c9d5" class="outline-2">
<h2 id="org769c9d5">Resources:</h2>
<div class="outline-text-2" id="text-org769c9d5">
<p>
<a href="https://htmx.org/">https://htmx.org/</a>
<a href="https://github.com/wmealing/learn-htmx">https://github.com/wmealing/learn-htmx</a>
</p>
</div>
</div>
</div>
</body>
</html>
